from django.urls import path
from .views import ContactView, NewsletterSubscribeView

# ======================================================================================================================
# نام فضای آدرس‌دهی اپلیکیشن تماس
app_name = 'contact'

# ======================================================================================================================
# مسیرهای مربوط به فرم تماس و خبرنامه
urlpatterns = [

    # صفحه تماس با ما (نمایش + ارسال فرم)
    path('contact-us/', ContactView.as_view(), name='contact-us'),

    # عضویت در خبرنامه
    path('newsletter/', NewsletterSubscribeView.as_view(), name='newsletter'),
]
# ======================================================================================================================