from django.urls import path
from .views import ContactView
# ======================================================================================================================
# نام فضای آدرس‌دهی اپلیکیشن تماس
app_name = 'contact'

# تعریف مسیرهای مربوط به صفحه تماس با ما
urlpatterns = [

    # نمایش و پردازش فرم تماس با ما
    path('contact-us', ContactView.as_view(), name='contact'),
]

# ======================================================================================================================
